src/config/Documents/ЗакрытиеПерегрузовЗаСезон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗакрытиеПерегрузовЗаСезон</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикамСезонные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщикуСезонный</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщикуСезонный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаказыПоставщикамСезонные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикамСезонные</Name>
			<Comment>остатки товаров в производстве (Китай)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщикуСезонный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуСезонный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВЭД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/ЗакрытиеПерегрузовЗаСезон/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ЗаказыПоставщикамСезонные.Записывать = Истина;
	Движения.ЗаказыПоставщикамСезонные.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЗаказыПоставщикамСезонные.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.ЗаказПоставщикуСезонный = ТекСтрокаТовары.ЗаказПоставщикуСезонный;
		Если ТекСтрокаТовары.ЗаказПоставщикуСезонный.Дата >= Дата("20170101000000") Тогда
			Движение.Подразделение = ТекСтрокаТовары.ЗаказПоставщикуСезонный.Подразделение;
			Движение.ВЭД =  ТекСтрокаТовары.ЗаказПоставщикуСезонный.Подразделение.ВЭД;
		конецЕсли;	
		Движение.Дата = Дата;
	КонецЦикла;

КонецПроцедуры
